package main

import (
	// Подключаем нашу папку internal/handlers, где лежит логика сайта.
	// "expense-tracker" — это имя нашего проекта из файла go.mod.
	"expense-tracker/internal/handlers"
	
	"fmt"      // Нужен для вывода сообщений в черное окно (консоль).
	"net/http" // Главный пакет для работы с сетью и создания серверов.
)

func main() {
	// Создаем локальный маршрутизатор (mux).
	// Он принимает запросы от браузера и решает, на какую страницу их отправить.
	mux := http.NewServeMux()

	// МАРШРУТ 1: Главная страница сайта (переходим на http://localhost:8080)
	// Запускает функцию ExpensesHandler, которая показывает форму и таблицу трат.
	mux.HandleFunc("/", handlers.ExpensesHandler)         

	// МАРШРУТ 2: Служебный адрес для приема данных из формы (метод POST).
	// Запускает функцию AddExpenseHandler, которая считывает сумму, описание и сохраняет их.
	mux.HandleFunc("/expenses/add", handlers.AddExpenseHandler) 

	// Печатаем в консоль текст, чтобы мы знали, что сервер успешно запустился.
	fmt.Println("Сервер Этапа 2 запущен на http://localhost:8080")

	// Запускаем сервер на порту 8080.
	// Эта строка работает бесконечно. Она остановится, только если выключить сервер.
	err := http.ListenAndServe(":8080", mux)
	
	// Если порт 8080 уже занят другой программой, сервер выдаст ошибку и запишет её сюда.
	if err != nil {
		fmt.Printf("Ошибка при запуске сервера: %v\n", err)
	}
}


