// package main указывает, что данный файл является главной точкой входа.
// Отсюда компилятор Go начинает сборку и запуск всего веб-приложения.
package main

import (
	// Подключаем наш собственный пакет с обработчиками запросов.
	// "expense-tracker" берется из файла go.mod, а далее указывается путь до папки.
	"expense-tracker/internal/handlers"
	
	"fmt"      // Стандартный пакет для форматированного вывода текста в консоль.
	"net/http" // Главный сетевой пакет Go для создания веб-сервера и работы с протоколом HTTP.
)

// Функция main запускается автоматически при старте приложения.
func main() {
	
	// Создаем новый изолированный маршрутизатор (ServeMux).
	// Он отвечает за сопоставление URL-адресов страниц с конкретными функциями-обработчиками.
	mux := http.NewServeMux()

	// Регистрируем маршруты Второго этапа в нашем маршрутизаторе:
	
	// 1. Главная страница (отображает интерфейс: форму ввода и таблицу со списком всех трат).
	// Передаем управление функции ExpensesHandler из пакета handlers.
	mux.HandleFunc("/", handlers.ExpensesHandler)         

	// 2. Служебный маршрут для обработки отправки формы добавления новой траты (работает по методу POST).
	// Передаем управление функции AddExpenseHandler из пакета handlers.
	mux.HandleFunc("/expenses/add", handlers.AddExpenseHandler) 

	// Выводим красивое уведомление в терминал VS Code, чтобы знать, что сервер успешно инициализирован.
	fmt.Println("Сервер Этапа 2 запущен на http://localhost:8080")

	// Запускаем веб-сервер на порту 8080 и передаем ему наш настроенный маршрутизатор (mux).
	// Метод ListenAndServe уходит в бесконечный цикл и слушает все входящие запросы от браузера.
	err := http.ListenAndServe(":8080", mux)
	
	// Если порт 8080 занят другим приложением или произошел сбой, Go запишет ошибку в переменную err.
	if err != nil {
		// Выводим сообщение о критической ошибке запуска в консоль.
		fmt.Printf("Ошибка при запуске сервера: %v\n", err)
	}
}
